In [1]:
import pandas as pd
import numpy as np

In [2]:
def extract_city_name(df):
   .....:     """
   .....:     Chicago, IL -> Chicago for city_name column
   .....:     """
   .....:     df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
   .....:     return df

In [3]:
def add_country_name(df, country_name=None):
   .....:     """
   .....:     Chicago -> Chicago-US for city_name column
   .....:     """
   .....:     col = 'city_name'
   .....:     df['city_and_country'] = df[col] + country_name
   .....:     return df

In [4]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

In [5]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [6]:
(df_p.pipe(extract_city_name)
         .pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [7]:
 df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [8]:
df

        one       two     three
a -0.136815 -0.491578       NaN
b -1.635071 -0.331569 -0.815680
c  1.591164 -0.015757  0.548698
d       NaN  0.211820  0.121578

In [9]:
df.apply(np.mean)

one     -0.060241
two     -0.156771
three   -0.048468
dtype: float64

In [10]:
df.apply(np.mean, axis=1)

a   -0.314196
b   -0.927440
c    0.708035
d    0.166699
dtype: float64

In [11]:
df.apply(lambda x: x.max() - x.min())

one      3.226235
two      0.703398
three    1.364378
dtype: float64

In [12]:
df.apply(np.cumsum)

        one       two     three
a -0.136815 -0.491578       NaN
b -1.771886 -0.823147 -0.815680
c -0.180722 -0.838904 -0.266982
d       NaN -0.627084 -0.145404

In [13]:
df.apply(np.exp)

        one       two     three
a  0.872132  0.611661       NaN
b  0.194939  0.717796  0.442338
c  4.909458  0.984367  1.730998
d       NaN  1.235926  1.129278

In [14]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [15]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.712272 -1.830526       NaN
b -2.211690 -1.777190 -1.938560
c -1.136279 -1.671919 -1.483767
d       NaN -1.596060 -1.626141

In [16]:
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -5.136815 -5.491578       NaN
b -6.635071 -5.331569 -5.815680
c -3.408836 -5.015757 -4.451302
d       NaN -4.788180 -4.878422